# DistributionSysTypes Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSetting..::..DistributionSysTypes Property
ElectricalSetting Class See Also
---
Get all distribution system types of the project.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DistributionSysTypeSet DistributionSysTypes { get; }
```

Visual Basic
---
```text
Public ReadOnly Property DistributionSysTypes As DistributionSysTypeSet
	Get
```

Visual C++
---
```text
public:
property DistributionSysTypeSet^ DistributionSysTypes {
	DistributionSysTypeSet^ get ();
}
```

# See Also
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace